// **Group members profiles**   
// Each profile consists of (1) avatar, (2) username, (3) personal description, (4) number of "likes" the profile will receive throughout the interaction
	
window.others = {
  "posts" : [
      {
        "avatar": "avatars/others/k.png",
        "username": "刘亚轩",
        "text": " 大家好，我是刘亚轩，2005年出生，MBTI是ENFP，我喜欢打羽毛球、骑摩托车，喜欢一切新鲜刺激的娱乐活动。大家都会觉得我是一个活泼开朗的人，是因为我觉得要用真诚的态度和他人交友，所以在与他人相处时，我会尽力展现我积极的一面。但在我看来，要是可以成为真正的朋友，我也可能展现出自己有缺点的一面。总之希望和同样真诚的人成为朋友~我还喜欢猫猫狗狗！家里养了一只神经奶牛猫和一只捡来的中华田园犬。",
        "likes": [45000, 50000, 110000, 150000] //4
      },
      {
        "avatar": "avatars/others/one.png",
        "username": "赵姗姗",
        "text": "我叫赵姗姗，21岁，大四，金融专业，目前在上海某证券交易所实习，MBTI是ENTJ。平时比较喜欢打网球、排球，也喜欢跳舞、徒步、摄影。非常喜欢kpop，应该算一个2.5次元。我生活中是一个比较乐观的人，因为我觉得没有什么事情是解决不了的，办法总比困难多。我也是那种喜欢社交的人，从不同的人身上，我可以了解到不同的故事，这种人与人之间的连接非常奇妙。另外，我还是一个穿搭和探店博主，平时会分享相关内容，欢迎感兴趣的朋友和我一起讨论。",
        "likes": [12000, 14000,15000,35000,80000,100000,110000,150000,20000] //9
      },
      {
		  
        "avatar": "avatars/others/luna.png",
	  "username": "文皓月",
        "text": "大家好！我是文皓月，是社会学专业在读的研究生，很高兴认识大家。我来自云南，一个山清水秀人杰地灵的地方，欢迎大家有空的时候去旅行，我可以免费提供攻略。我也是一个资深铲屎官，养了一只蓝白胖猫猫，叫拾壹，大家可以在我的朋友圈一起云养猫。我的兴趣爱好是唱歌、网球和乒乓球，平时常常去ktv唱杰伦和陶喆，也会和朋友一起打网球和乒乓球，每天晚上会和朋友开黑打游戏。面对即将毕业带来的压力，这些都是我的解压途径，让我能更好平衡学业和娱乐生活。",
		"likes": [20000, 21000] //2
      },
      {
        "avatar": "avatars/others/winnie.png",
        "username": "赵滢",
        "text": "在生活中，我总是很沉稳和文静，同时也很爱笑，因为我认为在目前的人生中本来就在为学业、生活一直忙碌了，总得自己多笑笑，给自己带来快乐的同时也可以为别人带来欢乐；在学习或者工作中，我做事认真、条理性和逻辑性强，同时在处理事情时带有一点完美主义的倾向，因此在学业和工作过程中总是尽量做到尽善尽美；在性格方面，我偏理性，与人相处能够在保持边界的同时温暖待人，通常能够与人很舒服地相处。总体上，我觉得自己是个简单、理性的人，也是一个正在一步一步实践自己目标的人。",
        "likes": [10000, 12000, 40000, 80000, 120000] //5
      },
      {
        "avatar": "avatars/others/qian.png",
        "username": "许桐菲",
        "text": " 大家好，很高兴见到大家！我家住天津，目前在一家咨询机构做实习。在生活中，我是一个情绪丰富的人，心情好的时候会很开心，但也会有很多细微的情感波动。人际交往中，我是一个随和的人，虽然会有敏感的地方，但是很少对人发脾气。工作上，我不喜欢拖延，希望自己是一个认真负责的人，我认为自己有进取心，但很多时候更希望自己能够享受人生、活出意义。我有很多的兴趣爱好，我喜欢听音乐、看电影、服装搭配，偶尔会看诗歌和小说，总之，热爱一切与美相关的事物。“She who seeks beauty will find it.”希望大家也能一直追求自己热爱的生活。",
        "likes": [40000, 450000, 90000, 100000, 150000, 155000] //6
      },
    {
        "avatar": "avatars/others/potato.png",
        "username": "陈丽娟",
        "text": "大家好，我是一名大学生，大家可以叫我丽娟。我热爱学习，对新知识充满好奇，喜欢探索未知的领域。我性格开朗，乐于助人，总是愿意倾听他人的故事，分享自己的见解。我热衷于参加各种社团活动，这不仅让我结识了许多志同道合的朋友，也锻炼了我的团队合作能力。在业余时间，我喜欢阅读、旅行和摄影。阅读让我能够开阔视野，旅行让我体验不同的文化，而摄影则是我记录生活、表达情感的方式。",
        "likes": [20000, 25000, 95000] //3
      },
      {
        "avatar": "avatars/others/fee.png",
        "username": "孙菲菲",
	  "text": "大家好，我是孙菲菲，来自西南大学外国语学院。我是一个既安静又热闹的人，在陌生人和不熟悉的人面前，我有一副高冷的面具，好像把人拒之千里之外:但在熟悉的人面前，我又十分话痨，叨叨不停，所以反差很大。我的外表没有什么记忆点，就爱好而言，我喜欢看书和慢跑，也喜欢一个人独处，可以接受热闹，也能忍受孤独。另外，我内心的想法很多，很喜欢天马行空，喜欢思想的交流碰撞。",
        "likes": [12000, 38000] //1
      },
          {
        "avatar": "avatars/others/king.png",
        "username": "金星",
        "text": " 你们好，我是金星，来自西大食品科学学院，我是一个比较慢热的男生，对于不熟的人我的话很少，可能会看起来有点高冷，但是其实我对所有人都是很友好的;对熟悉的人，我的话就会变得很多，当热我也可以是一个会倾听别人的人。我平时喜欢看小说，没有太多爱好，对美食和旅游都不是很热衷，但是我可以主打一个陪伴，陪朋友一起去体验，因为我本身是一个比较安静内敛的人，平时话不多，但是我会用行动去关心朋友。",
        "likes": [10000, 50000, 88000, 11000, 11500, 120000, 15000] //7
      },
      {
        "avatar": "avatars/others/juan.png",
        "username": "李灵",
        "text": "我是一枚充满活力的ENFP，爱搞抽象的女孩，自我定义外强中干。我在生活中比较独立，注重情绪价值，对世界的探索充满渴望——无论是山川的壮丽还是人间的温情，我都乐于去体验和感受。我的兴趣广泛，虽然不追求精通，但每一项都能带给我无限的乐趣。在众多运动中，我比较喜欢乒乓球和篮球。在学习上，我总是要么早早地完成任务，享受那份提前完成的满足感；要么在最后关头才匆匆完成，体验那种紧张刺激的冲刺。在小组作业中，我总是充当急急国王的角色，以便项目能够按时完成。简而言之，我是一个热爱生活、追求体验、及时享乐、热情活泼的ENFP女孩。",
        "likes": [12000, 40000, 120000] //3
      },
      {
        "avatar": "avatars/others/xun.png",
        "username": "荀雨鲲",
        "text": "嗨，大家可以叫我雨鲲。目前我是大四的学生。我觉得我的性格有点奇怪。一方面，我特别喜欢和朋友一起玩耍，和熟悉的人在一起的时候，我可以放得很开，我也很享受和熟悉的人在一起的时光。但是一遇到陌生人，或者和陌生人共处一室，要和他们打交道的时候，我就很胆小（当然我也不知道是胆小还是害羞）。我很爱我的家人。我有一个妹妹，她是在所有场合都很安静的人，我和妹妹从小一起长大，我们几乎没有闹过什么矛盾，虽然我们两个的性格截然相反。",
        "likes": [13000, 50000, 80000, 88000, 120000] //5
      },
      {
        "avatar": "avatars/others/qi.png",
        "username": "张七月",
        "text": "hello，各位同学大家好，我叫七月，来自河北保定，我的家乡历史悠久，是屈原风萧萧兮易水寒中的易水，那里有很多漂亮的风景，同时还有很多美食，比如驴肉火烧、牛肉罩饼 牛肉板面、里脊肉饼等等，很欢迎各位同学有时间来保定旅行！吃美食!我的兴趣爱好是旅游和做饭。很高兴来参加本次实验。",
        "likes": [10000, 50000] //6
      },

    ]
  };